# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

sequence = [2, 10, 5, 2, 4, 7, 10, 2, 2, 8]
print(set(sequence))
